app/Controllers/AccountManagementController.php

    private function getUsersWithFilters($filters = [])
    {
        $builder = $this->userModel->builder();

        if (!empty($filters['role'])) {
            $builder->where('role', $filters['role']);
        }

        if (!empty($filters['campus'])) {
            $builder->where('campus', $filters['campus']);
        }

        if (!empty($filters['status'])) {
            $isActive = $filters['status'] === 'active' ? 1 : 0;
            $builder->where('is_active', $isActive);
        }

        if (!empty($filters['search'])) {
            $builder->groupStart()
                   ->like('username', $filters['search'])
                   ->orLike('email', $filters['search'])
                   ->groupEnd();
        }

        $builder->orderBy('created_at', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC