app/Controllers/AtmLiquidationController.php

    public function index()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $filters = [
            'status' => $this->request->getGet('status'),
            'semester' => $this->request->getGet('semester'),
            'academic_year' => $this->request->getGet('academic_year')
        ];

        // Get individual liquidations with recipient details
        $liquidations = $this->atmDetailModel->getLiquidationsWithRecipients($filters);

        // Get batch-level records with uploader details
        $batches = $this->atmLiquidationModel->getBatchesWithUploader($filters);

        // Add recipient count and total amount for each batch
        foreach ($batches as &$batch) {
            $batch['recipient_count'] = $this->atmDetailModel->where('atm_liquidation_id', $batch['id'])->countAllResults();
            $batch['total_amount'] = $this->atmDetailModel->where('atm_liquidation_id', $batch['id'])->selectSum('amount')->get()->getRow()->amount ?? 0;
        }

        $data = [
            'title' => 'ATM Liquidations',
            'liquidations' => $liquidations,
            'batches' => $batches,
            'filters' => $filters,
            'user' => $this->userModel->find($this->session->get('user_id'))
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function create()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        // Fetch all scholarship recipients
        $recipients = $this->recipientModel->orderBy('last_name', 'ASC')->findAll();

        $data = [
            'title' => 'Create ATM Liquidation',
            'user' => $this->userModel->find($this->session->get('user_id')),
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function batchUploadForm()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Batch Upload ATM Liquidation',
            'user' => $this->userModel->find($this->session->get('user_id'))
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'