app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function authenticate()
    {
        $validation = \Config\Services::validation();

        if (!$this->validate([
            'username' => 'required',
            'password' => 'required'
        ])) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();