app/Controllers/Dashboard.php

    private function getMonthlyTrendsData($filters = [])
    {
        $monthlyData = [
            'labels' => [],
            'manual' => [],
            'atm' => []
        ];

        // Get data for the last 12 months
        for ($i = 11; $i >= 0; $i--) {
            $date = strtotime("-$i months");
            $month = date('Y-m', $date);
            $monthLabel = date('M', $date);

            $monthlyData['labels'][] = $monthLabel;

            // Count manual liquidations for this month
            $manualBuilder = $this->manualLiquidationModel->where("DATE_FORMAT(created_at, '%Y-%m')", $month)
                                                          ->where('status !=', 'hidden');

            if (!empty($filters['semester'])) {
                $manualBuilder->where('semester', $filters['semester']);
            }
            if (!empty($filters['academic_year'])) {
                $manualBuilder->where('academic_year', $filters['academic_year']);
            }
            if (!empty($filters['campus'])) {
                $manualBuilder->where('campus', $filters['campus']);
            }

            $monthlyData['manual'][] = $manualBuilder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE DATE_FORMAT(created_at, '%Y-%m') = '2025-01'
SELECT COUNT(*) AS `numrows`
FROM `manual_liquidations`
WHERE DATE_FORMAT(created_at, '%Y-%m') = '2025-01'
AND `status` != 'hidden'