app/Controllers/DisbursementController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function index()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        // Get filters
        $filters = [
            'campus' => $this->request->getGet('campus'),
            'semester' => $this->request->getGet('semester'),
            'academic_year' => $this->request->getGet('academic_year'),
            'status' => $this->request->getGet('status'),
            'date_from' => $this->request->getGet('date_from'),
            'date_to' => $this->request->getGet('date_to')
        ];

        // Get disbursement summary by officer
        $disbursementSummary = $this->getDisbursementSummary($filters);

        // Get individual disbursements
        $disbursements = $this->disbursementModel->getDisbursementsWithOfficers($filters);

        $data = [
            'title' => 'Disbursement List',
            'disbursement_summary' => $disbursementSummary,
            'disbursements' => $disbursements,
            'filters' => $filters,
            'user' => $this->userModel->find($this->session->get('user_id'))