app/Controllers/ManualLiquidationController.php

    public function index()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $filters = [
            'campus' => $this->request->getGet('campus'),
            'status' => $this->request->getGet('status'),
            'disbursing_officer' => $this->request->getGet('disbursing_officer'),
            'semester' => $this->request->getGet('semester'),
            'academic_year' => $this->request->getGet('academic_year')
        ];

        $liquidations = $this->manualLiquidationModel->getLiquidationsWithRecipients($filters);
        $disbursing_officers = $this->userModel->getUsersByRole('disbursing_officer');

        $data = [
            'title' => 'Manual Liquidations',
            'liquidations' => $liquidations,
            'disbursing_officers' => $disbursing_officers,
            'filters' => $filters,
            'user' => $this->userModel->find($this->session->get('user_id'))
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function show($id)
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $liquidation = $this->manualLiquidationModel->getLiquidationWithDetails($id);

        if (!$liquidation) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $data = [
            'title' => 'Liquidation Details',
            'liquidation' => $liquidation,
            'user' => $this->userModel->find($this->session->get('user_id'))
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'

    public function entryByRecipient()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $recipients = $this->recipientModel->findAll();

        $data = [
            'title' => 'Entry by Recipient',
            'recipients' => $recipients,
            'user' => $this->userModel->find($this->session->get('user_id'))
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function entryByOfficer()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $officers = $this->userModel->getUsersByRole('disbursing_officer');

        $data = [
            'title' => 'Entry by Officer',
            'officers' => $officers,
            'user' => $this->userModel->find($this->session->get('user_id'))
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'