app/Controllers/ReportsController.php

    public function index()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $user = $this->userModel->find($this->session->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    private function getLiquidationSubmissionsByRecipient($filters)
    {
        $builder = $this->db->table('scholarship_recipients sr');
        $builder->select('sr.recipient_id,
                         sr.first_name,
                         sr.last_name,
                         sr.campus,
                         sr.scholarship_type,
                         COUNT(DISTINCT ml.id) as manual_liquidations,
                         COUNT(DISTINCT ald.id) as atm_liquidations,
                         COALESCE(SUM(ml.amount), 0) + COALESCE(SUM(ald.amount), 0) as total_amount,
                         COUNT(DISTINCT CASE WHEN ml.status = "approved" THEN ml.id END) + COUNT(DISTINCT CASE WHEN ald.status = "approved" THEN ald.id END) as approved_count,
                         COUNT(DISTINCT CASE WHEN ml.status = "pending" THEN ml.id END) + COUNT(DISTINCT CASE WHEN ald.status = "pending" THEN ald.id END) as pending_count');

        $builder->join('manual_liquidations ml', 'ml.recipient_id = sr.id', 'left');
        $builder->join('atm_liquidation_details ald', 'ald.recipient_id = sr.id', 'left');

        $this->applyFilters($builder, $filters);

        $builder->groupBy('sr.id, sr.recipient_id, sr.first_name, sr.last_name, sr.campus, sr.scholarship_type');
        $builder->orderBy('total_amount', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `sr`.`recipient_id`, `sr`.`first_name`, `sr`.`last_name`, `sr`.`campus`, `sr`.`scholarship_type`, COUNT(DISTINCT ml.id) as manual_liquidations, COUNT(DISTINCT ald.id) as atm_liquidations, COALESCE(SUM(ml.amount), 0) + COALESCE(SUM(ald.amount), 0) as total_amount, COUNT(DISTINCT CASE WHEN ml.status = "approved" THEN ml.id END) + COUNT(DISTINCT CASE WHEN ald.status = "approved" THEN ald.id END) as approved_count, COUNT(DISTINCT CASE WHEN ml.status = "pending" THEN ml.id END) + COUNT(DISTINCT CASE WHEN ald.status = "pending" THEN ald.id END) as pending_count
FROM `scholarship_recipients` `sr`
LEFT JOIN `manual_liquidations` `ml` ON `ml`.`recipient_id` = `sr`.`id`
LEFT JOIN `atm_liquidation_details` `ald` ON `ald`.`recipient_id` = `sr`.`id`
GROUP BY `sr`.`id`, `sr`.`recipient_id`, `sr`.`first_name`, `sr`.`last_name`, `sr`.`campus`, `sr`.`scholarship_type`
ORDER BY `total_amount` DESC

    private function getLiquidationSubmissionsByCampus($filters)
    {
        $builder = $this->db->table('scholarship_recipients sr');
        $builder->select('sr.campus,
                         COUNT(DISTINCT sr.id) as total_recipients,
                         COUNT(DISTINCT ml.id) as manual_liquidations,
                         COUNT(DISTINCT ald.id) as atm_liquidations,
                         COALESCE(SUM(ml.amount), 0) + COALESCE(SUM(ald.amount), 0) as total_amount,
                         AVG(CASE WHEN ml.amount > 0 THEN ml.amount END) as avg_manual_amount,
                         AVG(CASE WHEN ald.amount > 0 THEN ald.amount END) as avg_atm_amount');

        $builder->join('manual_liquidations ml', 'ml.recipient_id = sr.id', 'left');
        $builder->join('atm_liquidation_details ald', 'ald.recipient_id = sr.id', 'left');

        $this->applyFilters($builder, $filters);

        $builder->groupBy('sr.campus');
        $builder->orderBy('total_amount', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `sr`.`campus`, COUNT(DISTINCT sr.id) as total_recipients, COUNT(DISTINCT ml.id) as manual_liquidations, COUNT(DISTINCT ald.id) as atm_liquidations, COALESCE(SUM(ml.amount), 0) + COALESCE(SUM(ald.amount), 0) as total_amount, AVG(CASE WHEN ml.amount > 0 THEN ml.amount END) as avg_manual_amount, AVG(CASE WHEN ald.amount > 0 THEN ald.amount END) as avg_atm_amount
FROM `scholarship_recipients` `sr`
LEFT JOIN `manual_liquidations` `ml` ON `ml`.`recipient_id` = `sr`.`id`
LEFT JOIN `atm_liquidation_details` `ald` ON `ald`.`recipient_id` = `sr`.`id`
GROUP BY `sr`.`campus`
ORDER BY `total_amount` DESC

    public function export()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $user = $this->userModel->find($this->session->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'