app/Controllers/ScholarshipCoordinatorController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `manual_liquidations`
WHERE `scholarship_coordinator_id` = '3'
AND `status` != 'hidden'
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function index()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $user = $this->userModel->find($this->session->get('user_id'));

        // Check if user is a scholarship coordinator
        if ($user['role'] !== 'scholarship_coordinator') {
            return redirect()->to('/dashboard')->with('error', 'Access denied. Scholarship Coordinator privileges required.');
        }

        // Get coordinator's campus
        $coordinatorCampus = $user['campus'];
        $coordinatorId = $user['id'];

        $filters = [
            'semester' => $this->request->getGet('semester'),
            'academic_year' => $this->request->getGet('academic_year'),
            'status' => $this->request->getGet('status'),
            'campus' => $coordinatorCampus // Filter by coordinator's campus
        ];

        // Get statistics for coordinator's campus
        $manualStats = $this->manualLiquidationModel->getDashboardStatistics($filters);
        $atmStats = $this->atmLiquidationModel->getDashboardStatistics($filters);

        // Get liquidations assigned to this coordinator
        $coordinatorLiquidations = $this->manualLiquidationModel
            ->where('scholarship_coordinator_id', $coordinatorId)
            ->where('status !=', 'hidden')
            ->orderBy('created_at', 'DESC')
            ->limit(10)
            ->findAll();

SELECT *
FROM `disbursements`
WHERE `campus` = 'Main Campus'
AND `status` != 'hidden'
ORDER BY `created_at` DESC
 LIMIT 5
---
        ]);

        // Get recent disbursements for this campus
        $recentDisbursements = $this->disbursementModel
            ->where('campus', $coordinatorCampus)
            ->where('status !=', 'hidden')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function myLiquidations()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $user = $this->userModel->find($this->session->get('user_id'));

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function manageLiquidations()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $user = $this->userModel->find($this->session->get('user_id'));

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function updateLiquidationStatus()
    {
        if (!$this->session->get('user_id')) {
            return $this->response->setJSON(['success' => false, 'message' => 'Unauthorized']);
        }

        $user = $this->userModel->find($this->session->get('user_id'));

SELECT *
FROM `manual_liquidations`
WHERE `manual_liquidations`.`id` = '4'
---

        foreach ($ids as $liquidationId) {
            // Get liquidation to verify campus
            $liquidation = $this->manualLiquidationModel->find($liquidationId);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `disbursements`
WHERE `campus` = 'Main Campus'
---
    public function reports()
    {
        if (!$this->session->get('user_id')) {
            return redirect()->to('/login');
        }

        $user = $this->userModel->find($this->session->get('user_id'));

        if ($user['role'] !== 'scholarship_coordinator') {
            return redirect()->to('/dashboard')->with('error', 'Access denied.');
        }

        $coordinatorCampus = $user['campus'];

        // Get report data
        $filters = [
            'campus' => $coordinatorCampus,
            'semester' => $this->request->getGet('semester'),
            'academic_year' => $this->request->getGet('academic_year')
        ];

        $reportData = [
            'manual_liquidations' => $this->manualLiquidationModel->getLiquidationsWithRecipients($filters),
            'campus_statistics' => $this->manualLiquidationModel->getDashboardStatistics($filters),
            'disbursements' => $this->disbursementModel->where('campus', $coordinatorCampus)->findAll()