app/Models/AtmLiquidationModel.php

    public function getBatchesWithUploader($filters = [])
    {
        $builder = $this->db->table($this->table . ' al');
        $builder->select('al.*,
            u.username as uploader_name,
            u.email as uploader_email,
            COUNT(ald.id) as recipient_count,
            COALESCE(SUM(ald.amount), 0) as total_amount');
        $builder->join('users u', 'al.uploaded_by = u.id', 'left');
        $builder->join('atm_liquidation_details ald', 'al.id = ald.atm_liquidation_id', 'left');

        if (isset($filters['status']) && !empty($filters['status'])) {
            $builder->where('al.status', $filters['status']);
        }

        if (isset($filters['semester']) && !empty($filters['semester'])) {
            $builder->where('al.semester', $filters['semester']);
        }

        if (isset($filters['academic_year']) && !empty($filters['academic_year'])) {
            $builder->where('al.academic_year', $filters['academic_year']);
        }

        $builder->groupBy('al.id');
        $builder->orderBy('al.created_at', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `al`.*, `u`.`username` as `uploader_name`, `u`.`email` as `uploader_email`, COUNT(ald.id) as recipient_count, COALESCE(SUM(ald.amount), 0) as total_amount
FROM `atm_liquidations` `al`
LEFT JOIN `users` `u` ON `al`.`uploaded_by` = `u`.`id`
LEFT JOIN `atm_liquidation_details` `ald` ON `al`.`id` = `ald`.`atm_liquidation_id`
GROUP BY `al`.`id`
ORDER BY `al`.`created_at` DESC

    public function getDashboardStatistics($filters = [])
    {
        $builder = $this->db->table($this->table);

        if (isset($filters['semester']) && !empty($filters['semester'])) {
            $builder->where('semester', $filters['semester']);
        }

        if (isset($filters['academic_year']) && !empty($filters['academic_year'])) {
            $builder->where('academic_year', $filters['academic_year']);
        }

        $stats = [];
        $stats['total_batches'] = $builder->countAllResults(false);
        $stats['uploaded'] = $builder->where('status', 'uploaded')->countAllResults(false);
        $stats['processing'] = $builder->where('status', 'processing')->countAllResults(false);
        $stats['processed'] = $builder->where('status', 'processed')->countAllResults(false);
        $stats['sent_to_chairman'] = $builder->where('status', 'sent_to_chairman')->countAllResults(false);
        $stats['approved'] = $builder->where('status', 'approved')->countAllResults(false);
        $stats['sent_to_accounting'] = $builder->where('status', 'sent_to_accounting')->countAllResults(false);
        $stats['completed'] = $builder->where('status', 'completed')->countAllResults(false);
        $stats['rejected'] = $builder->where('status', 'rejected')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
AND `status` = 'processing'
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
AND `status` = 'processing'
AND `status` = 'processed'
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
AND `status` = 'processing'
AND `status` = 'processed'
AND `status` = 'sent_to_chairman'
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
AND `status` = 'processing'
AND `status` = 'processed'
AND `status` = 'sent_to_chairman'
AND `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
AND `status` = 'processing'
AND `status` = 'processed'
AND `status` = 'sent_to_chairman'
AND `status` = 'approved'
AND `status` = 'sent_to_accounting'
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
AND `status` = 'processing'
AND `status` = 'processed'
AND `status` = 'sent_to_chairman'
AND `status` = 'approved'
AND `status` = 'sent_to_accounting'
AND `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `atm_liquidations`
WHERE `status` = 'uploaded'
AND `status` = 'processing'
AND `status` = 'processed'
AND `status` = 'sent_to_chairman'
AND `status` = 'approved'
AND `status` = 'sent_to_accounting'
AND `status` = 'completed'
AND `status` = 'rejected'