app/Models/ManualLiquidationModel.php

SELECT COUNT(*) AS `numrows`
FROM `manual_liquidations`
WHERE `status` != 'hidden'
AND `campus` = 'Main Campus'
SELECT COUNT(*) AS `numrows`
FROM `manual_liquidations`
WHERE `status` != 'hidden'
AND `campus` = 'Main Campus'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `manual_liquidations`
WHERE `status` != 'hidden'
AND `campus` = 'Main Campus'
AND `status` = 'pending'
AND `status` = 'verified'
SELECT COUNT(*) AS `numrows`
FROM `manual_liquidations`
WHERE `status` != 'hidden'
AND `campus` = 'Main Campus'
AND `status` = 'pending'
AND `status` = 'verified'
AND `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `manual_liquidations`
WHERE `status` != 'hidden'
AND `campus` = 'Main Campus'
AND `status` = 'pending'
AND `status` = 'verified'
AND `status` = 'approved'
AND `status` = 'rejected'
---
    public function getDashboardStatistics($filters = [])
    {
        // Manual liquidations stats (exclude hidden records)
        $builder = $this->db->table($this->table);
        $builder->where('status !=', 'hidden');

        if (isset($filters['campus']) && !empty($filters['campus'])) {
            $builder->where('campus', $filters['campus']);
        }

        if (isset($filters['semester']) && !empty($filters['semester'])) {
            $builder->where('semester', $filters['semester']);
        }

        if (isset($filters['academic_year']) && !empty($filters['academic_year'])) {
            $builder->where('academic_year', $filters['academic_year']);
        }

        if (isset($filters['disbursing_officer']) && !empty($filters['disbursing_officer'])) {
            $builder->where('disbursing_officer_id', $filters['disbursing_officer']);
        }

        $manualStats = [];
        $manualStats['total'] = $builder->countAllResults(false);
        $manualStats['pending'] = $builder->where('status', 'pending')->countAllResults(false);
        $manualStats['verified'] = $builder->where('status', 'verified')->countAllResults(false);
        $manualStats['approved'] = $builder->where('status', 'approved')->countAllResults(false);
        $manualStats['rejected'] = $builder->where('status', 'rejected')->countAllResults();

SELECT `ml`.*, `sr`.`recipient_id` as `recipient_code`, `sr`.`first_name`, `sr`.`last_name`, `sr`.`middle_name`, `sr`.`campus` as `recipient_campus`, `sr`.`email` as `recipient_email`, `sr`.`course`, `sr`.`year_level`, `u1`.`username` as `disbursing_officer_name`, `u1`.`email` as `officer_email`, `u2`.`username` as `coordinator_name`, `u2`.`email` as `coordinator_email`
FROM `manual_liquidations` `ml`
LEFT JOIN `scholarship_recipients` `sr` ON `ml`.`recipient_id` = `sr`.`id`
LEFT JOIN `users` `u1` ON `ml`.`disbursing_officer_id` = `u1`.`id`
LEFT JOIN `users` `u2` ON `ml`.`scholarship_coordinator_id` = `u2`.`id`
WHERE `ml`.`id` = '1'
---
    public function getLiquidationWithDetails($id)
    {
        $builder = $this->db->table($this->table . ' ml');
        $builder->select('ml.*, sr.recipient_id as recipient_code, sr.first_name, sr.last_name, sr.middle_name,
                         sr.campus as recipient_campus, sr.email as recipient_email, sr.course, sr.year_level,
                         u1.username as disbursing_officer_name, u1.email as officer_email,
                         u2.username as coordinator_name, u2.email as coordinator_email');
        $builder->join('scholarship_recipients sr', 'ml.recipient_id = sr.id', 'left');
        $builder->join('users u1', 'ml.disbursing_officer_id = u1.id', 'left');
        $builder->join('users u2', 'ml.scholarship_coordinator_id = u2.id', 'left');
        $builder->where('ml.id', $id);

        return $builder->get()->getRowArray();