app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `role` = 'disbursing_officer'
AND `is_active` = 1
---
    public function getUsersByRole($role)
    {
        return $this->where('role', $role)->where('is_active', 1)->findAll();